input: "data"
input_dim: 1
input_dim: 3
input_dim: 16
input_dim: 66
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 10
    bias_term: true
    pad: 0
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "max_pooling2d_3"
  type: "Pooling"
  bottom: "conv1"
  top: "max_pooling2d_3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "max_pooling2d_3"
  top: "conv2"
  convolution_param {
    num_output: 16
    bias_term: true
    pad: 0
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 0
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "flatten_2"
  type: "Flatten"
  bottom: "conv3"
  top: "flatten_2"
}
layer {
  name: "dense"
  type: "InnerProduct"
  bottom: "flatten_2"
  top: "dense"
  inner_product_param {
    num_output: 2
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "dense"
  top: "dense"
}
